Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded.WebHeight
Web Height.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded.WebThickness
Web Thickness.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded.BottomFlangeWidth
Bottom Flange Width.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded.BottomFlangeThickness
Bottom Flange Thickness.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded.TopFlangeWidth
Top Flange Width.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded.TopFlangeThickness
Top Flange Thickness.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Creates a new instance of Structural Section I Welded shape with the associated set of parameters,
used to attach to structural element.
width:
Section width.
height:
Section height, depth.
topFlangeThickness:
Top Flange Thickness.
topFlangeWidth:
Top Flange Width.
bottomFlangeThickness:
Bottom Flange Thickness.
bottomFlangeWidth:
Bottom Flange Width.
webThickness:
Web Thickness.
webHeight:
Web Height.
centroidHorizontal:
Distance from centroid to the left extremites along horizontal axis.
centroidVertical:
Distance from centroid to the upper extremites along vertical axis.
principalAxesAngle:
Rotation angle between the principal axes and cross section reference planes.
sectionArea:
Cross section area.
perimeter:
Painting surface of the unit length.
nominalWeight:
Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
momentOfInertiaStrongAxis:
Moment of Inertia about main strong axis (I).
momentOfInertiaWeakAxis:
Moment of Inertia about main weak axis (I).
elasticModulusStrongAxis:
Elastic section modulus about main strong axis for calculation of bending stresses.
elasticModulusWeakAxis:
Elastic section modulus about main weak axis for calculation of bending stresses.
plasticModulusStrongAxis:
Plastic section modulus in bending about main strong axis (Z, Wpl)
plasticModulusWeakAxis:
Plastic section modulus in bending about main weak axis.
torsionalMomentOfInertia:
Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation
torsionalModulus:
Section modulus for calculations of torsion stresses (Ct)
warpingConstant:
Warping constant (Cw, Iomega, H)
shearAreaStrongAxis:
Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).
shearAreaWeakAxis:
Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded
Defines parameters for I-shape Welded structural section.
Since:
2015